Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: - `concatMapEager` which runs all inner flows "at once" but the output flow will be in the order those inner flows were created.
zh_cn: - `concatMapEager`，它“同时”运行所有内部流，但输出流将按照创建内部流的顺序。

source: - `concatMap` that maps and runs one inner flow at a time and
zh_cn: - `concatMap` 一次映射并运行一个内部流

source: - a `BackpressureStrategy` enumeration that mandates the developer to specify the backpressure behavior to be applied.
zh_cn: - 一个 `BackpressureStrategy` 枚举，要求开发人员指定要应用的背压行为。

source: - a callback that will be called with an instance of the `Emitter<T>` interface for each incoming subscriber,
zh_cn: -将为每个传入的订阅者调用的回调，回调时带 `Emitter<T>` 接口实例，

source: - async or synchronous execution
zh_cn: - 异步或同步执行

source: - continued support for Java 6+ & [Android](https://github.com/ReactiveX/RxAndroid) 2.3+
zh_cn: - 继续支持 Java 6+ 和 [Android](https://github.com/ReactiveX/RxAndroid) 2.3+

source: - performance gains through design changes learned through the 1.x cycle and through [Reactive-Streams-Commons](https://github.com/reactor/reactive-streams-commons) research project.
zh_cn: - 从 1.x 周期和 [Reactive-Streams-Commons](https://github.com/reactor/reactive-streams-commons) 研究项目获得的设计变更带来的性能提升。

source: - single dependency: [Reactive-Streams](https://github.com/reactive-streams/reactive-streams-jvm)
zh_cn: - 单一依赖：[Reactive-Streams](https://github.com/reactive-streams/reactive-streams-jvm)

source: - virtual time and schedulers for parameterized concurrency
zh_cn: - 参数化并发的虚拟时间和调度程序

source: - §1.3 relaxation: `onSubscribe` may run concurrently with `onNext` in case the `FlowableSubscriber` calls `request()` from inside `onSubscribe` and it is the resposibility of `FlowableSubscriber` to ensure thread-safety between the remaining instructions in `onSubscribe` and `onNext`.
zh_cn: - §1.3 宽松：`onSubscribe` 可以与 `onNext` 同时运行，以防 `FlowableSubscriber` 从 `onSubscribe` 内部调用 `request()`，并且它是 `FlowableSubscriber` 的责任以确保在 `onSubscribe` 和 `onNext` 中的其余指令之间的线程安全。

source: - §2.12 relaxation: if the same `FlowableSubscriber` instance is subscribed to multiple sources, it must ensure its `onXXX` methods remain thread safe.
zh_cn: - §2.12 宽松：如果同一个 `FlowableSubscriber` 实例订阅了多个源，它必须确保它的 `onXXX` 方法保持线程安全。

source: - §2.3 relaxation: calling `Subscription.cancel` and `Subscription.request` from `FlowableSubscriber.onComplete()` or `FlowableSubscriber.onError()` is considered a no-operation.
zh_cn: - §2.3 宽松：从 `FlowableSubscriber.onComplete()` 或 `FlowableSubscriber.onError()` 调用 `Subscription.cancel` 和 `Subscription.request` 被认为是无操作。

source: - §3.9 relaxation: issuing a non-positive `request()` will not stop the current stream but signal an error via `RxJavaPlugins.onError`.
zh_cn: - §3.9 宽松：发出一个非肯定的 `request()` 不会停止当前流，但会通过 `RxJavaPlugins.onError` 发出错误信号。

source: -- "how does the TCP identify duplicate segments from previous incarnations of the connection?" This problem becomes apparent if the connection is being opened and closed in quick succession, or if the connection breaks with loss of memory and is then reestablished.
zh_cn: - “TCP 如何识别以前连接的复制报文段？”如果快速连续打开和关闭连接，或者连接因内存丢失而中断然后重新建立，则此问题变得明显。

source: // If Java 8 lambdas are supported
zh_cn: //如果支持 Java 8 lambdas

source: // If no Retrolambda or Jack
zh_cn: //如果没有 Retrolambda 或 Jack

source: 0-RTT data cannot be duplicated within a connection (i.e., the server will not process the same data twice for the same connection), and an attacker will not be able to make 0-RTT data appear to be 1-RTT data (because it is protected with different keys).
zh_cn: 0-RTT 数据不能在连接中复制(即，服务器不会为同一连接处理相同的数据两次)，并且攻击者将无法使 0-RTT 数据看起来像 1-RTT 数据(因为它受不同的密钥保护)。

source: 0-RTT messages sent in the first flight have the same (encrypted) content types as messages of the same type sent in other flights (handshake and application_data) but are protected under different keys.
zh_cn: 在第一次航班中发送的 0-RTT 消息具有与在其他航班(握手和 application_data)中发送的相同类型的消息相同(加密)的内容类型，但受不同密钥的保护。

source: 1 - old sequence numbers which have been acknowledged
zh_cn: 1 - 已确认的序列号

source: 1.Any response message which "MUST NOT" include a message-body (such as the 1xx, 204, and 304 responses and any response to a HEAD request) is always terminated by the first empty line after the header fields, regardless of the entity-header fields present in the message.
zh_cn: 1.任何“绝不”包括消息体的响应消息(例如 1xx，204 和 304 响应以及对 HEAD 请求的任何响应)始终由首部字段之后的第一个空行终止，而不管消息中存在实体首部字段。

source: 2 - sequence numbers allowed for new reception
zh_cn: 2 - 允许新接收的序列号

source: 2-9 argument version dropped, use `startWithArray` instead
zh_cn: 2-9 参数版本删除，使用 `startWithArray` 代替

source: 2.If a Transfer-Encoding header field (section 14.41) is present and has any value other than "identity", then the transfer-length is defined by use of the "chunked" transfer-coding (section 3.6), unless the message is terminated by closing the connection.
zh_cn: 2.如果存在 Transfer-Encoding 首部字段(第 14.41 节)并且具有“identity”以外的任何值，则使用“chunked”传输编码(第 3.6 节)定义传输长度，除非消息通过关闭连接终止。

source: 2xx (Successful) responses to a CONNECT request method (Section 4.3.6 of [RFC7231]) switch to tunnel mode instead of having a message body.
zh_cn: 对 CONNECT 请求方法的 2xx(成功)响应([RFC7231] 的第 4.3.6 节)切换到隧道模式而不是具有消息体。

source: 3 - future sequence numbers which are not yet allowed
zh_cn: 3 - 未来允许的序列号

source: 3.If a Content-Length header field (section 14.13) is present, its decimal value in OCTETs represents both the entity-length and the transfer-length.
zh_cn: 3.如果存在 Content-Length 首部字段(第 14.13 节)，则其八位字节的十进制值代表实体长度和传输长度。

source: 4.If the message uses the media type "multipart/byteranges", and the ransfer-length is not otherwise specified, then this self- elimiting media type defines the transfer-length.
zh_cn: 4.如果消息使用媒体类型“multipart/byteranges”，并且未指定 ransfer-length，则此自我修饰媒体类型定义传输长度。

source: 48-byte secret shared between the client and server.
zh_cn: 客户端和服务器之间共享的 48 字节密钥。

source: 5-9 source overloads dropped
zh_cn: 5-9 源重载删除

source: 5.By the server closing the connection.
zh_cn: 5.由服务器关闭连接。

source: <"> = <US-ASCII double-quote mark (34)>
zh_cn: <"> = <US-ASCII 双引号 (34)>

source: Single — a specialized version of an Observable that emits only a single item
zh_cn: Single — 特殊版本的 Observable，仅发射单个项目

source: Another Scheduler method allows you to schedule an action to take place at regular intervals.
zh_cn: 另一个 Scheduler 方法 允许您调度定期执行的操作。

source: The Subscribe method is how you connect an observer to an Observable.
zh_cn: Subscribe 方法 是将观察者连接到 Observable 的方式。

source: The TestScheduler allows you to exercise fine-tuned manual control over how the Scheduler’s clock behaves.
zh_cn: The TestScheduler 允许您对调度器的时钟行为进行微调手动控制。

source: RFC 6151 details the security considerations, including collision attacks for MD5, published in 2011.
zh_cn: RFC 6151 详细介绍了 2011 年发布的安全注意事项，包括 MD5 的碰撞攻击。

source: Observable is a single abstraction that can be used for any of these use cases.
zh_cn: Observable 是一个可用于任何这些用例的抽象。

source: PublishSubject emits to an observer only those items that are emitted by the source Observable(s) subsequent to the time of the subscription.
zh_cn: PublishSubject 仅向观察者发射订阅时间之后由源 Observable 发射的那些项目。

source: ReplaySubject emits to any observer all of the items that were emitted by the source Observable(s), regardless of when the observer subscribes.
zh_cn: 无论观察者何时订阅，ReplaySubject 都会向任何观察者发射源 Observable 发射的所有项目。

source: <m> occurrences of element.
zh_cn: <m> 个元素的出现。

source: ObserveOn, on the other hand, affects the thread that the Observable will use below where that operator appears.
zh_cn: 另一方面，ObserveOn 会影响 Observable 将在 下面 出现的操作符使用的线程。

source: <sup>1</sup>: When turning a multi-valued source into a single valued source, one should decide which of the many source values should be considered as the result.
zh_cn: <sup>1</sup>：当将多值源转换为单值源时，应该决定应该将多个源值中的哪一个视为结果。

source: <sup>1</sup>The `org.reactivestreams.Publisher` is part of the external Reactive Streams library.
zh_cn: <sup>1</sup> `org.reactivestreams.Publisher` 是外部 Reactive Streams 库的一部分。

source: <sup>2</sup>: Turning an `Observable` into `Flowable` requires an additional decision: what to do with the potential unconstrained flow
zh_cn: <sup>2</sup>：将 `Observable` 转换为 `Flowable` 需要另外一个决定：如何处理潜在的无约束流

source: <sup>2</sup>The naming convention of the interface was to append `Source` to the semi-traditional class name.
zh_cn: <sup>2</sup> 接口的命名约定是将 `Source` 附加到半传统类名。

source: <sup>3</sup>: When there is only (at most) one source item, there is no problem with backpressure as it can be always stored until the downstream is ready to consume.
zh_cn: <sup>3</sup>：当只有(最多)一个源项时，背压没有问题，因为它可以一直存储，直到下游准备好消费。

source: A "cache" is a local store of previous response messages and the subsystem that controls its message storage, retrieval, and deletion.
zh_cn: “缓存”是先前响应消息的本地存储，以及控制其消息存储，检索和删除的子系统。

source: A "gateway" (a.k.a."reverse proxy") is an intermediary that acts as an origin server for the outbound connection but translates received requests and forwards them inbound to another server or servers.
zh_cn: “网关”(也称为“反向代理”)是充当出站连接的源服务器但是转换所接收的请求并将它们转发到另一个或多个服务器的中介。

source: A "non-transparent proxy" is a proxy that modifies the request or response in order to provide some added service to the user agent, such as group annotation services, media type transformation, protocol reduction, or anonymity filtering.
zh_cn: “非透明代理”是修改请求或响应以便向用户代理提供一些附加服务的代理，例如组注释服务，媒体类型转换，协议减少或匿名过滤。

source: A "proxy" is a message-forwarding agent that is selected by the client, usually via local configuration rules, to receive requests for some type(s) of absolute URI and attempt to satisfy those requests via translation through the HTTP interface.
zh_cn: “代理”是客户端(通常通过本地配置规则)选择的消息转发代理，以接收对某些类型的绝对 URI 的请求，并尝试通过 HTTP 接口转换来满足这些请求。

source: A "signature_algorithms_cert" extension (Section 4.2.3) may also be added to indicate certificate-specific signature algorithms.
zh_cn: 还可以添加“signature_algorithms_cert”扩展(第 4.2.3 节)以指示特定于证书的签名算法。

source: A "strong entity tag" MAY be shared by two entities of a resource only if they are equivalent by octet equality.
zh_cn: 只有当资源的两个实体八位字节相等时，“强实体标记”才可由资源的两个实体共享。

source: A "transparent proxy" is a proxy that does not modify the request or response beyond what is required for proxy authentication and identification.
zh_cn: “透明代理”是一种代理，它不会修改超出代理身份验证和标识所需的请求或响应。

source: A "tunnel" acts as a blind relay between two connections without changing the messages.
zh_cn: “隧道”充当两个连接之间的盲中继，而不改变消息。

source: A "weak entity tag," indicated by the "W/" prefix, MAY be shared by two entities of a resource only if the entities are equivalent and could be substituted for each other with no significant change in semantics.
zh_cn: 由“W/”前缀表示的“弱实体标签”可以由资源的两个实体共享，只有当实体是等效的并且可以彼此替换而语义没有显着变化时。

source: A --> B ACK your sequence number is Y
zh_cn: A --> B ACK 你的序列号是 Y

source: A --> B SYN my sequence number is X
zh_cn: A --> B SYN 我的序列号是 X

source: A 128-bit IPv6 address is divided into eight 16-bit pieces.
zh_cn: 128 位 IPv6 地址分为 8 个 16 位片段。

source: A 200 response SHOULD include any header fields that indicate optional features implemented by the server and applicable to that resource (e.g., Allow), possibly including extensions not defined by this specification.
zh_cn: 200 响应应该包括任何首部字段，其指示服务器实现并适用于该资源的可选特征(例如，允许)，可能包括未由本规范定义的扩展。

source: A 32-byte value provided by the client.
zh_cn: 客户端提供的 32 字节值。

source: A 32-byte value provided by the server.
zh_cn: 服务器提供的 32 字节值。

source: A 48-byte secret shared between the two peers in the connection.
zh_cn: 在连接中的两个对等端之间共享的 48 字节机密。

source: A <-- B ACK your sequence number is X
zh_cn: A <-- B ACK 你的序列号是 X

source: A <-- B SYN my sequence number is Y
zh_cn: A <-- B SYN 我的序列号是 Y

source: A CRLF is allowed in the definition of TEXT only as part of a header field continuation.
zh_cn: TEXT 的定义中仅允许 CRLF 作为头字段连续的一部分。

source: A Decision Tree of Observable Operators
zh_cn: Observable 操作符的决策树

source: A Finished message MUST be sent regardless of whether the Certificate message is empty.
zh_cn: 无论 Certificate 消息是否为空，都必须发送 Finished 消息。

source: A Finished message is always sent immediately after a change cipher spec message to verify that the key exchange and authentication processes were successful.
zh_cn: Finished 消息总是在更改加密规范消息之后立即发送，以验证密钥交换和身份验证过程是否成功。

source: A HEAD response might also have an effect on previously cached responses to GET; see Section 4.3.5 of [RFC7234].
zh_cn: HEAD 响应也可能对以前缓存的 GET 响应产生影响；请参见 [RFC7234] 的第 4.3.5 节。

source: A HTTP response with a valid Content-Length header closed before all data has been read.
zh_cn: 在读取所有数据之前关闭了具有有效 Content-Length 首部的 HTTP 响应。

source: A HTTP response without a Content-Length header.
zh_cn: 没有 Content-Length 首部的 HTTP 响应。

source: A Host header field is also sent, as defined in Section 5.4.
zh_cn: 还会发送主机首部字段，如第 5.4 节中所定义。

source: A SYN-ACK is returned (line 3) and causes TCP A to generate a RST (the ACK in line 3 is not acceptable).
zh_cn: 返回 SYN-ACK(第 3 行)并使 TCP A 生成 RST(第 3 行中的 ACK 不可接受)。

source: A Single is something like an Observable, but instead of emitting a series of values — anywhere from none at all to an infinite number — it always either emits one value or an error notification.
zh_cn: Single 就像一个 Observable，但它不发射一系列值 - 从零个到无限个 - 它总是发射一个值或一个错误通知。

source: A Single will call only one of these methods, and will only call it once.
zh_cn: Single 将只调用其中一个方法，并且只调用一次。

source: A Subject is a sort of bridge or proxy that is available in some implementations of ReactiveX that acts both as an observer and as an Observable.
zh_cn: Subject 是一种桥梁或代理，在 ReactiveX 的某些实现中可用，它既充当观察者又充当 Observable。

source: A TCP connection progresses from one state to another in response to events.
zh_cn: TCP 连接从一个状态进展到另一个状态以响应事件。

source: A TCP header follows the internet header, supplying information specific to the TCP protocol.
zh_cn: TCP 首部跟随 IP 首部，提供特定于 TCP 协议的信息。

source: A TCP must implement all options.
zh_cn: TCP 必须实现所有选项。

source: A TCP will reliably deliver all buffers SENT before the connection was CLOSED so a user who expects no data in return need only wait to hear the connection was CLOSED successfully to know that all his data was received at the destination TCP.
zh_cn: TCP 将在连接被 CLOSED 之前可靠地 SENT 传递所有缓冲区，因此期望没有数据返回的用户只需等待成功地听到连接已成功 CLOSED，以便知道他的所有数据都在目标 TCP 上接收。

source: A TLS connection state is the operating environment of the TLS Record Protocol.
zh_cn: TLS 连接状态是 TLS 记录协议的操作环境。

source: A TLS implementation MAY, after sending a closure alert, close the connection without waiting for the peer to send its closure alert, generating an "incomplete close".
zh_cn: 在发送关闭警报后，TLS 实现可以关闭连接，而无需等待对等方发送其关闭警报，从而生成“未完成关闭”。

source: A TLS implementation MUST NOT automatically resend early data unless the negotiated connection selects the same ALPN protocol.
zh_cn: 除非协商连接选择相同的 ALPN 协议，否则 TLS 实现绝不能自动重新发送早期数据。

source: A TLS implementation SHOULD NOT automatically resend early data;
zh_cn: TLS 实现不应自动重新发送早期数据；

source: A TLSCiphertext record was received that had a length more than 2^14+2048 bytes, or a record decrypted to a TLSCompressed record with more than 2^14+1024 bytes.
zh_cn: 收到长度大于 2^14+2048 字节的 TLSCiphertext 记录，或者解密为超过 2^14+1024 字节的 TLSCompressed 记录的记录。

source: A TRACE request MUST NOT include an entity.
zh_cn: TRACE 请求不得包含实体。

source: A URI can be further classified as a locator, a name, or both.
zh_cn: URI 可以进一步分类为定位符，名称或两者。

source: A URI is an identifier consisting of a sequence of characters matching the syntax rule named <URI> in Section 3.
zh_cn: URI 是一个标识符，由一系列符合第 3 节中名为 <URI> 的语法规则的字符组成。

source: A URI is composed from a limited set of characters consisting of digits, letters, and a few graphic symbols.
zh_cn: URI 由一组有限的字符组成，这些字符由数字，字母和一些图形符号组成。

source: A URI reference (Section 2.7) is typically used as an identifier for the "target resource", which a user agent would resolve to its absolute form in order to obtain the "target URI".
zh_cn: URI 引用(第 2.7 节)通常用作“target resource”的标识符，用户代理将其解析为其绝对形式以获得“target URI”。

source: A URI resolution implementation might use DNS, host tables, yellow pages, NetInfo, WINS, or any other system for lookup of registered names.
zh_cn: URI 解析实现可能使用 DNS，主机表，黄页，NetInfo，WINS 或任何其他系统来查找已注册的名称。

source: A URI with a fragment identifier may be used to refer to the secondary resource without any implication that the primary resource is accessible or will ever be accessed.
zh_cn: 具有片段标识符的 URI 可以用于指代辅助资源，而不暗示主资源是可访问的或将被访问。

source: A URI-reference is either a URI or a relative reference.
zh_cn: URI 引用是 URI 或相对引用。

source: A URI-reference is typically parsed first into the five URI components, in order to determine what components are present and whether the reference is relative.
zh_cn: 通常首先将 URI 引用解析为五个 URI 组件，以便确定存在哪些组件以及引用是否是相对的。

source: A Uniform Resource Identifier (URI) is a compact sequence of characters that identifies an abstract or physical resource.
zh_cn: 统一资源标识符(URI)是一种紧凑的字符序列，用于标识抽象或物理资源。

source: A Uniform Resource Identifier (URI) is a compact string of characters for identifying an abstract or physical resource.
zh_cn: 统一资源标识符 (Uniform Resource Identifier) (URI)是用于标识抽象或物理资源的紧凑字符串。

source: A Uniform Resource Identifier (URI) provides a simple and extensible means for identifying a resource.
zh_cn: 统一资源标识符(URI)提供了一种用于标识资源的简单且可扩展的方法。

source: A cache behaves in a "semantically transparent" manner, with respect to a particular response, when its use affects neither the requesting client nor the origin server, except to improve performance.
zh_cn: 当缓存的使用既不影响请求客户端也不影响源服务器时，缓存在“语义透明”方式中表现为特定响应，除了提高性能。

source: A cache stores cacheable responses in order to reduce the response time and network bandwidth consumption on future, equivalent requests.
zh_cn: 缓存存储可缓存的响应，以减少对未来等效请求的响应时间和网络带宽消耗。

source: A certificate has expired or is not currently valid.
zh_cn: 证书已过期或当前无效。

source: A certificate that begins a certification path MAY use a signature algorithm that is not advertised as being supported in the "signature_algorithms" extension.
zh_cn: 开始证书路径的证书可以使用未在“signature_algorithms”扩展中支持的签名算法。

source: A certificate was corrupt, contained signatures that did not verify correctly, etc.
zh_cn: 证书已损坏，包含未正确验证的签名等。

source: A certificate was of an unsupported type.
zh_cn: 证书的类型不受支持。

source: A certificate was revoked by its signer.
zh_cn: 证书被其签名者撤销。

source: A chain of Observable operators do not operate independently on the original Observable that originates the chain, but they operate in turn, each one operating on the Observable generated by the operator immediately previous in the chain.
zh_cn: 链式 Observable 操作符不能在原始的 Observable 上独立运行，它们是依次 操作，每个操作符操作的 Observable 由链中的前一个操作符生成。

source: A client MAY discard or truncate received header fields that are larger than the client wishes to process if the field semantics are such that the dropped value(s) can be safely ignored without changing the message framing or response semantics.
zh_cn: 如果字段语义使得可以安全地忽略删除的值而不改变消息成帧或响应语义，则客户端可以删除或截断大于客户端希望处理的接收的首部字段。

source: A client MAY send a Max-Forwards header field in an OPTIONS request to target a specific recipient in the request chain (see Section 5.1.2).
zh_cn: 客户端可以在 OPTIONS 请求中发送 Max-Forwards 首部字段，以定位请求链中的特定接收者(请参阅第 5.1.2 节)。

source: A client MAY send a list of protocols in the Upgrade header field of a request to invite the server to switch to one or more of those protocols, in order of descending preference, before sending the final response.
zh_cn: 客户端可以在请求的升级首部字段中发送协议列表，以便在发送最终响应之前按照优先级降序的顺序邀请服务器切换到这些协议中的一个或多个。

source: A client MAY send a lower request version if it is known that the server incorrectly implements the HTTP specification, but only after the client has attempted at least one normal request and determined from the response status code or header fields (e.g., Server) that the server improperly handles higher request versions.
zh_cn: 如果已知服务器错误地实现 HTTP 规范，则客户端可以发送较低请求版本，但仅在客户端尝试了至少一个正常请求并且从响应状态代码或首部字段(例如，服务器)确定服务器不正确地处理更高的请求版本。

source: A client MAY send additional requests on a persistent connection until it sends or receives a "close" connection option or receives an HTTP/1.0 response without a "keep-alive" connection option.
zh_cn: 客户端可以在持久连接上发送其他请求，直到它发送或接收“close”连接选项或接收没有“keep-alive”连接选项的 HTTP/1.0 响应。

source: A client MUST NOT generate header fields in a TRACE request containing sensitive data that might be disclosed by the response.
zh_cn: 客户端不得在包含可能由响应公开的敏感数据的 TRACE 请求中生成首部字段。

source: A client MUST NOT include the "early_data" extension in its followup ClientHello.
zh_cn: 客户端不得在其后续 ClientHello 中包含“early_data”扩展。

source: A client MUST NOT process, cache, or forward such extra data as a separate response, since such behavior would be vulnerable to cache poisoning.
zh_cn: 客户端不得将此类额外数据作为单独的响应进行处理，缓存或转发，因为此类行为容易受到缓存中毒的影响。

source: A client MUST NOT send a message body in a TRACE request.
zh_cn: 客户端不得在 TRACE 请求中发送消息正文。

source: A client MUST NOT send a request containing Transfer-Encoding unless it knows the server will handle HTTP/1.1 (or later) requests; such knowledge might be in the form of specific user configuration or by remembering the version of a prior received response.
zh_cn: 客户端不得发送包含 Transfer-Encoding 的请求，除非它知道服务器将处理 HTTP/1.1(或更高版本)请求；这些知识可以是特定用户配置的形式，也可以是记住先前接收的响应的版本。

source: A client MUST NOT send a version to which it is not conformant.
zh_cn: 客户端不得发送不符合的版本。

source: A client MUST ignore any Content-Length or Transfer-Encoding header fields received in a successful response to CONNECT.
zh_cn: 客户端必须忽略在成功响应 CONNECT 时收到的任何 Content-Length 或 Transfer-Encoding 首部字段。

source: A client MUST ignore any Content-Length or Transfer-Encoding header fields received in such a message.
zh_cn: 客户端必须忽略在这样的消息中接收的任何 Content-Length 或 Transfer-Encoding 首部字段。

source: A client MUST provide a "psk_key_exchange_modes" extension if it offers a "pre_shared_key" extension.
zh_cn: 如果客户端提供“pre_shared_key”扩展，则必须提供“psk_key_exchange_modes”扩展。

source: A client MUST send a Host header field in all HTTP/1.1 request messages.
zh_cn: 客户端必须在所有 HTTP/1.1 请求消息中发送 Host 首部字段。

source: A client MUST send a Host header field in an HTTP/1.1 request even if the request-target is in the absolute-form, since this allows the Host information to be forwarded through ancient HTTP/1.0 proxies that might not have implemented Host.
zh_cn: 客户端必须在 HTTP/1.1 请求中发送 Host 首部字段，即使请求目标是绝对形式，因为这允许主机信息通过可能没有实现主机的古老 HTTP/1.0 代理转发。

source: A client SHOULD NOT automatically retry a failed automatic retry.
zh_cn: 客户端不应该自动重试失败的自动重试。

source: A client SHOULD ignore the reason-phrase content.
zh_cn: 客户端应该忽略原因 - 短语内容。

source: A client SHOULD send a request version equal to the highest version to which the client is conformant and whose major version is no higher than the highest version supported by the server, if this is known.
zh_cn: 客户端应该发送一个请求版本，该版本等于客户端符合的最高版本，其主要版本不高于服务器支持的最高版本(如果已知)。

source: A client can alter the semantics of GET to be a "range request", requesting transfer of only some part(s) of the selected representation, by sending a Range header field in the request ([RFC7233]).
zh_cn: 客户端可以通过在请求中发送 Range 首部字段来将 GET 的语义改变为“范围请求”，请求仅传输所选表示的一些部分（[RFC7233]）。

source: A client cannot begin using an upgraded protocol on the connection until it has completely sent the request message (i.e., the client can't change the protocol it is sending in the middle of a message).
zh_cn: 在完全发送请求消息之前，客户端不能开始在连接上使用升级的协议(即，客户端不能在消息中间改变它正在发送的协议)。

source: A client constructs request messages to communicate specific intentions, examines received responses to see if the intentions were carried out, and determines how to interpret the results.
zh_cn: 客户构建请求消息以传达特定意图，检查收到的响应以查看意图是否已执行，并确定如何解释结果。

source: A client detecting an incomplete close SHOULD recover gracefully.
zh_cn: 检测到不完整关闭的客户端应该优雅地恢复。

source: A client or server that wishes to time out SHOULD issue a graceful close on the connection.
zh_cn: 希望超时的客户端或服务器应该在连接上发出正常关闭。
